Autodesk.Revit.DB.FillGrid.GetPointLineZone(Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV@)
Gets the index of fill grid line and the point on the grid line nearest to the input point.
point:
Input point.
nearestPoint:
The point on the grid line nearest to the input point.
Returns:
The index of fill grid line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillGrid.GetPointLineZone(Autodesk.Revit.DB.UV)
Gets the index of fill grid line closest to the input 2d point.
point:
Input point.
Returns:
The index of fill grid line.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillGrid.GetSegmentDirection
Provides the segment direction.
Returns:
The direction of segment.
Since:
2012

Autodesk.Revit.DB.FillGrid.GetHatchingDirection
Provides the hatching propagation. Hatching is inverted.
Returns:
The direction of hatching.
Since:
2012

Autodesk.Revit.DB.FillGrid.CalculateLinesPerLength
Calculates the number of solid lines of the pattern per unit length.
Returns:
The solid lines per length.
Since:
2012

Autodesk.Revit.DB.FillGrid.CalculateStrokesPerArea
Calculates the number of the segments of the pattern per unit area.
Returns:
The strokes per area.
Since:
2012

Autodesk.Revit.DB.FillGrid.CalculateLengthPerArea
Calculates length of the pattern per unit area.
Returns:
The length per area.
Since:
2012

Autodesk.Revit.DB.FillGrid.IsEqual(Autodesk.Revit.DB.FillGrid)
Check if two fill grids are equal.
other:
The fill grid to be compared.
Returns:
True if the two fill grids are equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillGrid.SetSegments(System.Collections.Generic.IList{System.Double})
Sets the segments to the fill grid.
segArr:
The segments to be used.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillGrid.GetSegments
Gets the segments of the fill grid.
Returns:
The segments.
Since:
2012

Autodesk.Revit.DB.FillGrid.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FillGrid.Shift
Gets and sets the shift of the fill grid.
Remarks:
Shift moves the pattern of dashes and spaces along the length of each new parallel line.
Shift is ignored if the line is solid.
The shift of the fill grid.
Since:
2012

Autodesk.Revit.DB.FillGrid.Offset
Gets and sets the offset of the fill grid.
Remarks:
Offset defines the distance between parallel lines. A zero offset is not allowed.
The offset of the fill grid.
Since:
2012

Autodesk.Revit.DB.FillGrid.Origin
Gets and sets the origin of the fill grid.
The origin of the fill grid.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillGrid.Angle
Gets and sets the angle of the fill grid.
Since:
2012

Autodesk.Revit.DB.FillGrid.#ctor(System.Double,System.Double)
Creates a simple fill grid with given angle and spacing.
angle:
The angle.
spacing:
The spacing.
Since:
2012

Autodesk.Revit.DB.FillGrid.#ctor
Creates a simple fill grid.
Since:
2012

Autodesk.Revit.DB.FillGrid.#ctor(Autodesk.Revit.DB.FillGrid)
Constructs a new FillGrid with default settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.FillGrid
Represents a grid line in a fill pattern.
Remarks:
A grid line is described in the two dimensions of a face as follows:
angle, origin, shift, offset, segments
Angle specifies the direction, in degrees, of the grid line relative to the x-axis. Parallel lines are drawn as specified by Offset and Shift to fill the entire face.
Offset defines the distance between parallel lines. Zero Offset is not allowed.
Shift moves the pattern of dashes and spaces along the length of each new parallel line.
Shift is ignored if the line is solid.The segments defines a repeating pattern of dashes and spaces for the grid line. If it is
omitted, the line is solid. Positive numbers define dashes, negative numbers define spaces, and
zero specifies a dot. If you begin a pattern with a space, do not alternate dashes and spaces,
or do not end with a space, Revit will introduce tiny dashes or spaces to compensate. Revit
expands dots and very short dashes into dashes of a minimum size.
Since:
2012